In [1]:
# examples and exercises in chapter 2.2 of the Chinese version of book "Joyful Pandas" (pandas数据处理与分析)

In [1]:
import numpy as np
import pandas as pd

In [4]:
import os
os.chdir("../../")

In [5]:
# 2.2.1

In [15]:
s = pd.Series(data = [100, "a", {"dic1": 5}],
             index = pd.Index(["id1", 20, "third"], name="my_idx"),
             dtype="object",
             name="my_name")
s

my_idx
id1              100
20                 a
third    {'dic1': 5}
Name: my_name, dtype: object

In [8]:
s.values

array([100, 'a', {'dic1': 5}], dtype=object)

In [9]:
s.index

Index(['id1', 20, 'thrid'], dtype='object', name='my_idx')

In [10]:
s.dtype

dtype('O')

In [11]:
s.name

'my_name'

In [12]:
s.shape

(3,)

In [16]:
s["third"]

{'dic1': 5}

In [17]:
# 2.2.2

In [37]:
data = [[1, "a", 1.2],  [2, 'b', 2.2], [3, "c", 3.2]]
df = pd.DataFrame(data=data,
                 index=["row_%d"%i for i in range(3)],
                 columns=["col_0", "col_1", "col2"])
df

       col_0 col_1  col2
row_0      1     a   1.2
row_1      2     b   2.2
row_2      3     c   3.2

In [38]:
df = pd.DataFrame(data = {"col_0": [1,2,3], "col_1": list("abc"), "col_2": [1.2, 2.2, 3.2]},
                 index = ["row_%d"%i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

In [20]:
# Ex2-2

In [39]:
s = pd.Series(data = [1,2,3],
             index = pd.Index(["row_%d"%i for i in range(1, 4)], name="my_idx"),
             dtype="int",
             name="my_series")
# s = pd.Series(data=[1,2,3])
df = pd.DataFrame(data = {"col_0": s, "col_1": list("abc"), "col_2": [1.2, 2.2, 3.2]},
                 index = ["row_%d"%i for i in range(3)])
df

       col_0 col_1  col_2
row_0    NaN     a    1.2
row_1    1.0     b    2.2
row_2    2.0     c    3.2

In [31]:
# Ex2-3
# The first returns a Series whilst the second returns a DataFrame

In [76]:
df = pd.DataFrame(data = {"col_0": [1,2,3], "col_1": list("abc"), "col_2": [1.2, 2.2, 3.2]},
                 index = pd.Index(["row_%d"%i for i in range(3)], name="my_index"))
df

          col_0 col_1  col_2
my_index
row_0         1     a    1.2
row_1         2     b    2.2
row_2         3     c    3.2

In [42]:
df["col_0"]

row_0    1
row_1    2
row_2    3
Name: col_0, dtype: int64

In [43]:
df[["col_0"]]

       col_0
row_0      1
row_1      2
row_2      3

In [44]:
df["col_0"].to_frame()

       col_0
row_0      1
row_1      2
row_2      3

In [45]:
df.values

array([[1, 'a', 1.2],
       [2, 'b', 2.2],
       [3, 'c', 3.2]], dtype=object)

In [49]:
df.index

Index(['row_0', 'row_1', 'row_2'], dtype='object', name='my_index')

In [50]:
df.columns

Index(['col_0', 'col_1', 'col_2'], dtype='object')

In [52]:
df.dtypes

col_0      int64
col_1     object
col_2    float64
dtype: object

In [53]:
df.shape

(3, 3)

In [57]:
df.T

my_index row_0 row_1 row_2
col_0        1     2     3
col_1        a     b     c
col_2      1.2   2.2   3.2

In [55]:
# Ex2-4

In [66]:
df_transposed = pd.DataFrame(
    data = np.swapaxes(df.values, 0, 1),
    index=df.columns,
    columns=df.index
)
df_transposed

my_index row_0 row_1 row_2
col_0        1     2     3
col_1        a     b     c
col_2      1.2   2.2   3.2

In [77]:
df["col_0"] = df["col_0"].values[::-1]
df["col_2"] *= 2
df["col_3"] = ["apple", "banna", "cat"]
df

          col_0 col_1  col_2  col_3
my_index
row_0         3     a    2.4  apple
row_1         2     b    4.4  banna
row_2         1     c    6.4    cat

In [78]:
df.drop(["col_3"], axis=1)

          col_0 col_1  col_2
my_index
row_0         3     a    2.4
row_1         2     b    4.4
row_2         1     c    6.4

In [79]:
df.drop(["row_1"])

          col_0 col_1  col_2  col_3
my_index
row_0         3     a    2.4  apple
row_2         1     c    6.4    cat

In [80]:
df = df[df.columns[:-1]]
df

          col_0 col_1  col_2
my_index
row_0         3     a    2.4
row_1         2     b    4.4
row_2         1     c    6.4